google.charts.load('current', { 'packages': ['bar'] });
google.charts.setOnLoadCallback(drawChart);

function drawChart() {
    var data = google.visualization.arrayToDataTable([
        ['Αριθμός', 'Καθυστερήσεις'],
        ['80', 20],
		['79', 17],
		['78', 15],
		['77', 14],
		['76', 20],
		['75', 17],
		['74', 15],
		['73', 14],
		['72', 20],
		['71', 17],
		['70', 20],
		['69', 17],
		['68', 15],
		['67', 14],
		['66', 20],
		['65', 17],
		['64', 15],
		['63', 14],
		['62', 20],
		['61', 17],
		['60', 20],
		['59', 17],
		['58', 15],
		['57', 14],
		['56', 20],
		['55', 17],
		['54', 15],
		['53', 14],
		['52', 20],
		['51', 17],
		['50', 20],
		['49', 17],
		['48', 15],
		['47', 14],
		['46', 20],
		['45', 17],
		['44', 15],
		['43', 14],
		['42', 20],
		['41', 17],
		['40', 20],
		['39', 17],
		['38', 15],
		['37', 14],
		['36', 20],
		['35', 17],
		['34', 15],
		['33', 14],
		['32', 20],
		['31', 17],
		['30', 20],
		['29', 17],
		['28', 15],
		['27', 14],
		['26', 20],
		['25', 17],
		['24', 15],
		['23', 14],
		['22', 20],
		['21', 17],
		['20', 20],
		['19', 17],
		['18', 15],
		['17', 14],
		['16', 20],
		['15', 17],
		['14', 15],
		['13', 14],
		['12', 20],
		['11', 17],
		['10', 20],
		['9', 17],
		['8', 15],
		['7', 14],
		['6', 20],
		['5', 17],
		['4', 15],
		['3', 14],
		['2', 20],
		['1', 17],
    ]);

    var options = {
        legend: { position: 'none' },
        bars: 'horizontal', // Required for Material Bar Charts.
        axes: {
            x: {
                0: { side: 'top', label: 'Καθυστερήσεις' } // Top x-axis.
            }
        },
        height: 2000
        // bar: { groupWidth: "100%" },

    };

    var chart = new google.charts.Bar(document.getElementById('barchart'));
    chart.draw(data, google.charts.Bar.convertOptions(options));
}

window.addEventListener('resize', drawChart);